Natalia-Test/integrator/ACAMO-integrator-tool/templates/updateICMoreContactData

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext"
  xmlns:con="urn:crmondemand/ws/ecbs/contact/"
  xmlns:data="urn:/crmondemand/xml/Contact/Data">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1">
      <wsse:UsernameToken>
        <wsse:Username>${getICMoreUserName(body.variables.queuename)}</wsse:Username>
        <wsse:Password Type="wsse:PasswordText">${getICMorePassword(body.variables.queuename)}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <con:ContactUpdate_Input>
      <data:ListOfContact lastpage="1" recordcount="1">
        <!--Zero or more repetitions:-->
        <data:Contact operation="ContactUpdate">
          <!-- Contact id -->
          <data:Id>${body.variables.ContactId}</data:Id>
          <!--Contact ExternalSystemId -->
          <data:ExternalSystemId>${body.variables.CONTACT_AlternateCountry}_${body.variables.MWSContactId}</data:ExternalSystemId>
          <!--Contact CustomText30 -->
          <data:CustomText30>${body.variables.MWSContactId}</data:CustomText30>
          <!-- Contact Type: Contact when not synched, Contact BO when synchronized -->
          <data:ContactType>Contact BO</data:ContactType>
        </data:Contact>
      </data:ListOfContact>
    </con:ContactUpdate_Input>
  </soapenv:Body>
</soapenv:Envelope>